# Create a Python connection with SQL database and retrieve the results of the last two queries (also mentioned below) as dataframes:

### Importing libraries

In [1]:
from sqlalchemy import create_engine
import pandas as pd
from getpass import getpass  # To get the password without showing the input

import matplotlib
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np
#sns.set_theme(style="whitegrid")

from sklearn.metrics import confusion_matrix
from sklearn.metrics import plot_confusion_matrix
from sklearn.metrics import cohen_kappa_score
from sklearn.metrics import accuracy_score

from sklearn.model_selection import train_test_split
from sklearn.linear_model import LogisticRegression

### Establishing the connection with MySQL

In [2]:
password = getpass("INSERT YOUR PASSWORD: ")

INSERT YOUR PASSWORD: ········

In [3]:
# this is the general syntax 'dialect+driver://username:password@host:port/database'
# to create the connection string
connection_string = 'mysql+pymysql://root:' + password + '@localhost/sakila'
engine = create_engine(connection_string)

### Use pandas to have the rentals_may and rentals_june as a dataset

In [4]:
data = pd.read_sql_query('SELECT * FROM sakila.rentals_may', engine)
data.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53

In [5]:
data = pd.read_sql_query('SELECT * FROM sakila.rentals_june', engine)
data.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1158,2005-06-14 22:53:33,1632,416,2005-06-18 21:37:33,2,2006-02-15 21:30:53
1,1159,2005-06-14 22:55:13,4395,516,2005-06-17 02:11:13,1,2006-02-15 21:30:53
2,1160,2005-06-14 23:00:34,2795,239,2005-06-18 01:58:34,2,2006-02-15 21:30:53
3,1161,2005-06-14 23:07:08,1690,285,2005-06-21 17:12:08,1,2006-02-15 21:30:53
4,1162,2005-06-14 23:09:38,987,310,2005-06-23 22:00:38,1,2006-02-15 21:30:53

### Check the number of rentals for each customer for May

In [6]:
query = 'SELECT customer_id, COUNT(*) AS num_rentals_may \
FROM rental \
WHERE MONTH(rental_date) = 5 \
GROUP BY customer_id'
rentals_may_df = pd.read_sql_query(query, engine)
rentals_may_df.head()

   customer_id  num_rentals_may
0            1                2
1            2                1
2            3                2
3            5                3
4            6                3

### Check the number of rentals for each customer for June

In [7]:
query = 'SELECT customer_id, COUNT(*) AS num_rentals_june \
FROM rentals_june \
GROUP BY customer_id'
rentals_june_df = pd.read_sql_query(query, engine)
rentals_june_df.head()

   customer_id  num_rentals_june
0            1                 7
1            2                 1
2            3                 4
3            4                 6
4            5                 5

## Write a function that checks if customer borrowed more or less films in the month of June as compared to May.

### Merge both tables

In [8]:
rentals_df = rentals_may_df.merge(rentals_june_df, on="customer_id", how="inner")
rentals_df.head()

   customer_id  num_rentals_may  num_rentals_june
0            1                2                 7
1            2                1                 1
2            3                2                 4
3            5                3                 5
4            6                3                 4

### Comparing the months

In [9]:
rentals_df['comparison'] = "More rented in June" #introducing a new column

In [10]:
rentals_df['comparison'][rentals_df['num_rentals_may']>rentals_df['num_rentals_june']] = 'More rented in May'
rentals_df['comparison'][rentals_df['num_rentals_may'] == rentals_df['num_rentals_june']] = 'Same'
rentals_df.sample(50) #inserted conditions can be seen

C:\Users\fekad\AppData\Local\Temp\ipykernel_10004\3023311186.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  rentals_df['comparison'][rentals_df['num_rentals_may']>rentals_df['num_rentals_june']] = 'More rented in May'
C:\Users\fekad\AppData\Local\Temp\ipykernel_10004\3023311186.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  rentals_df['comparison'][rentals_df['num_rentals_may'] == rentals_df['num_rentals_june']] = 'Same'

     customer_id  num_rentals_may  num_rentals_june           comparison
106          128                2                 2                 Same
246          299                2                 7  More rented in June
151          184                3                 2   More rented in May
313          379                2                 3  More rented in June
153          186                2                 6  More rented in June
194          238                2                 3  More rented in June
204          249                4                 5  More rented in June
216          263                2                 2                 Same
279          338                1                 7  More rented in June
245          298                1                 4  More rented in June
38            49                4                 5  More rented in June
206          251                6                 3   More rented in May
164          199                1                 3  More rented in June
58            73                2                 2                 Same
390          469                5                 2   More rented in May
130          157                2                 1   More rented in May
352          425                1                 1                 Same
88           109                7                 5   More rented in May
208          253                3                 6  More rented in June
272          327                1                 6  More rented in June
261          314                2                 2                 Same
435          522                1                 4  More rented in June
8             10                1                 5  More rented in June
409          493                1                 4  More rented in June
115          141                1                 3  More rented in June
119          145                1                 2  More rented in June
417          501                2                 2                 Same
366          441                1                 2  More rented in June
479          574                1                 5  More rented in June
308          373                1                 2  More rented in June
463          553                1                 3  More rented in June
404          486                3                 4  More rented in June
135          164                1                 3  More rented in June
284          346                2                 3  More rented in June
172          210                1                 2  More rented in June
36            47                3                 3                 Same
132          159                4                 2   More rented in May
325          391                5                 5                 Same
482          577                1                 3  More rented in June
90           111                1                 6  More rented in June
396          476                2                 4  More rented in June
168          204                4                 6  More rented in June
138          167                3                 3                 Same
303          366                1                 2  More rented in June
161          196                4                 8  More rented in June
235          287                3                 4  More rented in June
253          306                2                 2                 Same
289          352                1                 5  More rented in June
122          148                1                 5  More rented in June
387          466                1                 5  More rented in June